app/controllers/instructors_controller.rb

  def index
    @instructors = Instructor.all
---
SELECT * FROM `instructors`

  def show
    @instructor = Instructor.find(params[:id])
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 328495050)

  def create
    @instructor = Instructor.new(params[:instructor])

    respond_to do |format|
      if @instructor.save
---
INSERT INTO `instructors` (`updated_at`, `user_id`, `course_id`, `created_at`) VALUES('2010-02-01 03:26:43', 19850104, 2010, '2010-02-01 03:26:43')

  def destroy
    @instructor = Instructor.find(params[:id])
    @instructor.destroy
---
SELECT * FROM `instructors` WHERE (`instructors`.`id` = 942826334)
DELETE FROM `instructors` WHERE `id` = 942826334