app/controllers/semesters_controller.rb

SELECT * FROM `semesters`
---
  def index
    @semesters = Semester.all